asset/code/ci4/app/Models/Iuran_model.php

    public function getIuran($id = false)
    {
        if($id === false){
            return $this->table('iuran')
                        ->join('warga', 'warga.nik = iuran.warga_nik')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `iuran`
JOIN `warga` ON `warga`.`nik` = `iuran`.`warga_nik`

    public function saveIuran($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
---
INSERT INTO `iuran` (`keterangan`, `tanggal`, `bulan`, `tahun`, `jumlah`, `warga_nik`) VALUES ('Bayar Kas', '2022-07-08', '7', '2022', '5000000', '312010176')