asset/code/ci4/app/Models/Warga_model.php

    public function getWarga($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `warga`
SELECT *
FROM `warga`
WHERE `id` = '5'

    public function saveWarga($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
---
INSERT INTO `warga` (`id`, `nik`, `nama`, `kelamin`, `alamat`, `no_rumah`, `status`) VALUES (NULL, '312010176', 'Ningsih', 'P', 'Liyue', '21', '1')

    public function editWarga($data,$id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id', $id);
        return $builder->update($data);
---
UPDATE `warga` SET `id` = '1', `nik` = '3120010131', `nama` = 'Oktovan Agung Shailendra', `kelamin` = 'L', `alamat` = 'Karang Bahagia', `no_rumah` = '22', `status` = '1'
WHERE `id` = '1'

    public function hapusWarga($id)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['id' => $id]);
---
DELETE FROM `warga`
WHERE `id` = '5'